In [1]:
import numpy as np
import pandas as pd

**Pivot tables**

In [10]:
# A pivot table is used to summarize large datasets into a simple, readable table
# It groups data based on categories (rows and columns)
# It performs calculations like sum, mean, count, or median on numeric values
# It helps compare data easily across different categories
# In simple words: pivot table = organize data + calculate numbers + show neatly

In [11]:
data = {
    "Date": pd.date_range("2023-01-01", periods=20),
    "Product": ["A", "B", "C", "D"] * 5,
    "Region": [
        "East", "West", "North", "South",
        "East", "West", "North", "South",
        "East", "West", "North", "South",
        "East", "West", "North", "South",
        "East", "West", "North", "South"
    ],
    "Sales": np.random.randint(100, 1000, 20),
    "Units": np.random.randint(10, 100, 20),
    "Rep": [
        "John", "Mary", "Bob", "Alice",
        "John", "Mary", "Bob", "Alice",
        "John", "Mary", "Bob", "Alice",
        "John", "Mary", "Bob", "Alice",
        "John", "Mary", "Bob", "Alice"
    ]
}

df = pd.DataFrame(data)

# Extract month name from Date
df["Month"] = df["Date"].dt.month_name()

# Create quarter column (Q1, Q2, Q3, Q4)
df["Quarter"] = "Q" + df["Date"].dt.quarter.astype(str)
df

         Date Product Region  Sales  Units    Rep    Month Quarter
0  2023-01-01       A   East    744     97   John  January      Q1
1  2023-01-02       B   West    484     68   Mary  January      Q1
2  2023-01-03       C  North    654     80    Bob  January      Q1
3  2023-01-04       D  South    925     93  Alice  January      Q1
4  2023-01-05       A   East    929     28   John  January      Q1
5  2023-01-06       B   West    495     45   Mary  January      Q1
6  2023-01-07       C  North    258     17    Bob  January      Q1
7  2023-01-08       D  South    701     13  Alice  January      Q1
8  2023-01-09       A   East    107     65   John  January      Q1
9  2023-01-10       B   West    294     35   Mary  January      Q1
10 2023-01-11       C  North    587     41    Bob  January      Q1
11 2023-01-12       D  South    603     22  Alice  January      Q1
12 2023-01-13       A   East    120     78   John  January      Q1
13 2023-01-14       B   West    349     91   Mary  January      Q1
14 2023-01-15       C  North    843     43    Bob  January      Q1
15 2023-01-16       D  South    960     54  Alice  January      Q1
16 2023-01-17       A   East    921     65   John  January      Q1
17 2023-01-18       B   West    672     41   Mary  January      Q1
18 2023-01-19       C  North    800     53    Bob  January      Q1
19 2023-01-20       D  South    165     94  Alice  January      Q1

In [12]:
# Create a pivot table to summarize sales data
# pd.pivot_table is used to reshape and aggregate data
# It is similar to Excel Pivot Tables but more powerful and flexible

pd.pivot_table(
    df,
    values="Sales",        # Column to aggregate (numeric values)
    index="Region",        # Rows of the pivot table (grouped by Region)
    columns="Product",     # Columns of the pivot table (grouped by Product)
    aggfunc="median"       # Aggregation function (mean, sum, count, min, max, median, etc.)
)

Product      A      B      C      D
Region
East     744.0    NaN    NaN    NaN
North      NaN    NaN  654.0    NaN
South      NaN    NaN    NaN  701.0
West       NaN  484.0    NaN    NaN

**Cross tabs**

In [13]:
df

         Date Product Region  Sales  Units    Rep    Month Quarter
0  2023-01-01       A   East    744     97   John  January      Q1
1  2023-01-02       B   West    484     68   Mary  January      Q1
2  2023-01-03       C  North    654     80    Bob  January      Q1
3  2023-01-04       D  South    925     93  Alice  January      Q1
4  2023-01-05       A   East    929     28   John  January      Q1
5  2023-01-06       B   West    495     45   Mary  January      Q1
6  2023-01-07       C  North    258     17    Bob  January      Q1
7  2023-01-08       D  South    701     13  Alice  January      Q1
8  2023-01-09       A   East    107     65   John  January      Q1
9  2023-01-10       B   West    294     35   Mary  January      Q1
10 2023-01-11       C  North    587     41    Bob  January      Q1
11 2023-01-12       D  South    603     22  Alice  January      Q1
12 2023-01-13       A   East    120     78   John  January      Q1
13 2023-01-14       B   West    349     91   Mary  January      Q1
14 2023-01-15       C  North    843     43    Bob  January      Q1
15 2023-01-16       D  South    960     54  Alice  January      Q1
16 2023-01-17       A   East    921     65   John  January      Q1
17 2023-01-18       B   West    672     41   Mary  January      Q1
18 2023-01-19       C  North    800     53    Bob  January      Q1
19 2023-01-20       D  South    165     94  Alice  January      Q1

In [16]:
# Create a cross-tabulation (frequency table)
# pd.crosstab counts how many times each combination appears

pd.crosstab(
    index=df["Region"],    # Rows: unique values from Region column
    columns=df["Product"]  # Columns: unique values from Product column
)

Product  A  B  C  D
Region
East     5  0  0  0
North    0  0  5  0
South    0  0  0  5
West     0  5  0  0